{
  "@context": "https://schema.org",
  "@type": "FAQPage",
  "mainEntity": [
    {
      "@type": "Question",
      "name": "Are you a second chance property?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "No, we are NOT a second chance property and do not offer second chance rentals. If you have a previous eviction, your rental application will be denied."
      }
    },
    {
      "@type": "Question",
      "name": "What are the criteria or requirements to apply for an apartment?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Income 3x rent. No evictions. No debt owed to apartments."
      }
    },
    {
      "@type": "Question",
      "name": "What is the application process like?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Income 3x rent. No evictions. No debt owed to apartments."
      }
    },
    {
      "@type": "Question",
      "name": "Do you accept Section 8?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "No, Sun Chase Apartments in Las Vegas does not accept Section 8 housing vouchers."
      }
	},
    {
      "@type": "Question",
      "name": "Can I pay rent with Bitcoin?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Yes, Sun Chase Apartments in Las Vegas accepts Bitcoin for rent. Pay rent in Bitcoin at Sun Chase Apartments in Las Vegas."
      }
	},
    {
      "@type": "Question",
      "name": "What appliances are in the apartment?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Washer and dryer (laundry in unit), Dishwasher, Stove, Refrigerator, Garbage Disposal, Hot water heater, Central heating and cooling, Microwave"
      }
    },
    {
      "@type": "Question",
      "name": "When is rent due?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "3rd of every month. Late fee is 5% of rent."
      }
    },
    {
      "@type": "Question",
      "name": "What is the penalty for breaking the lease?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "2 months of rent. You must pay 2 months worth of rent AFTER your move-out date."
      }
    },
    {
      "@type": "Question",
      "name": "Is Sun Chase Apartments a gated community?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "No, Sun Chase Apartments is not gated."
      }
    },
    {
      "@type": "Question",
      "name": "What amenities do you have?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Pool and spa, Putting greens mini-golf course, Gym / fitness center open 24/7, Public park next door (Winchester-Dondero Park)"
      }
    },
    {
      "@type": "Question",
      "name": "Do you have on-site management?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "There is a leasing office on the property. Management is accessible in-person during normal business hours. There is also a full-time maintenance staff to respond to maintenance requests and repairs."
      }
    },
    {
      "@type": "Question",
      "name": "What if a maintenance emergency happens after hours?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Call 702-327-8137 to reach the maintenance emergency line. We only respond to real emergencies that cannot wait until the next business day, such as air conditioning or floods."
      }
    },
    {
      "@type": "Question",
      "name": "What time does the pool close?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "The pool is only open during normal business hours."
      }
    },
    {
      "@type": "Question",
      "name": "Does Sun Chase Apartments in Las Vegas have roaches and bed bugs?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Sun Chase Apartments in Las Vegas has a professional pest control company that sprays for bugs EVERY SINGLE WEEK in apartments that need it—where we send them at resident request or preventatively. You will never find an apartment that is immune to bugs. All apartments that share a wall with another apartment can get roaches. We can't control what people bring into their apartments. What we can control is getting rid of them fast before they spread, which is why we spray and fumigate often. "
      }
    },
    {
      "@type": "Question",
      "name": "What are the schools in the area near Sun Chase Apartments in Las Vegas?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Kindergarden and Elementary: Will Beckley. Middle school: KO Knudson. High school: Valley. All schools are within 0-1.3 miles of the apartment complex."
      }
    },
    {
      "@type": "Question",
      "name": "How long is the lease at Sun Chase Apartments in Las Vegas?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "1 year. No 6 months or shorter leases."
      }
    },
    {
      "@type": "Question",
      "name": "Does Sun Chase Apartments in Las Vegas have pest control?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Yes, Sun Chase Apartments in Las Vegas uses a professional pest control company that sprays for bugs EVERY SINGLE WEEK in apartments that need it."
      }
    },
    {
      "@type": "Question",
      "name": "What is the pet deposit?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "$0. Sun Chase Apartments in Las Vegas does not charge pet deposits."
      }
    },
    {
      "@type": "Question",
      "name": "Is Sun Chase Apartments in Las Vegas pet friendly?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Yes, Sun Chase Apartments in Las Vegas is pet friendly. No pet deposit. No fees for cats. Pet rent for dogs starts at $25/month, price depending on breed and weight."
      }
    },
    {
      "@type": "Question",
      "name": "What's the application fee at Sun Chase Apartments in Las Vegas?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "$45 per adult."
      }
    },
    {
      "@type": "Question",
      "name": "Does Sun Chase Apartments in Las Vegas have admin fees?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "No, Sun Chase Apartments in Las Vegas does not have admin fees or any surprise charges to move in."
      }
    },
    {
      "@type": "Question",
      "name": "What utilities are included at Sun Chase Apartments in Las Vegas?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Water, sewer, and trash is included in the rent. You have to pay electricity separately. There is no gas."
      }
    },
    {
      "@type": "Question",
      "name": "How much is the security deposit?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Security depsoit starts at $200 but could be more depending on credit."
      }
    },
    {
      "@type": "Question",
      "name": "What if I move in the middle of the month? Is the first month's rent prorated at Sun Chase Apartments in Las Vegas?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "To move in, you must pay a full month's rent. Your next rent payment will be prorated—a smaller amount. For example, let's say you move in on the 15th of June; there are 16 days left in the month. Before you move in, you pay the full rent, say, $800. Then next month, on July 1st, your rent is only 16 days worth of rent: $427. We just want the bigger amount of rent first. In the end, you only ever pay rent for the days you were actually here."
      }
    },
    {
      "@type": "Question",
      "name": "Can I have a satellite dish at Sun Chase Apartments in Las Vegas?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "No. Use cable from one of the local cable providers such as Cox or Century Link."
      }
    },
    {
      "@type": "Question",
      "name": "What options for cable are available at Sun Chase Apartments?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "The two companies which service the area are Cox Communications and Century Link."
      }
    },
    {
      "@type": "Question",
      "name": "Are appliances gas or electric?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "All electric."
      }
    },
    {
      "@type": "Question",
      "name": "Can I pay rent online at Sun Chase Apartments in Las Vegas?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Yes, visit pay.sunchaselv.com to access our online portal to pay rent online."
      }
    },
    {
      "@type": "Question",
      "name": "What payment methods are accepted at Sun Chase Apartments in Las Vegas?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Money order, Cashier's check, Check, Credit Card, Bitcoin, Venmo, Zelle"
      }
    },
    {
      "@type": "Question",
      "name": "How can I pay rent at Sun Chase Apartmentsin Las Vegas?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Money order, Cashier's check, Check, Credit Card, Bitcoin, Venmo, Zelle"
      }
    }
  ]
}
